; ModuleID = '/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc53.c'
source_filename = "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc53.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, i32, i32*, i16*, float, float }

@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"Press ENTER to continue\0A\00", align 1
@nx = dso_local global i32 0, align 4, !dbg !0
@ny = dso_local global i32 0, align 4, !dbg !21
@num_rr_nodes = dso_local global i32 0, align 4, !dbg !27
@rr_node = dso_local global %struct.s_rr_node* null, align 8, !dbg !29
@io_rat = dso_local global i32 0, align 4, !dbg !23
@pins_per_clb = dso_local global i32 0, align 4, !dbg !25

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @MUSTALIAS(i8* %p, i8* %q) #0 !dbg !52 {
entry:
  %p.addr = alloca i8*, align 8
  %q.addr = alloca i8*, align 8
  store i8* %p, i8** %p.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %p.addr, metadata !58, metadata !DIExpression()), !dbg !59
  store i8* %q, i8** %q.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %q.addr, metadata !60, metadata !DIExpression()), !dbg !61

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nx", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc53.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/mem_leak/malloc53.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "SOURCE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SINK", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "IPIN", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "OPIN", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "CHANX", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "CHANY", value: 5, isUnsigned: true)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!20 = !{!0, !21, !23, !25, !27, !29}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "ny", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "io_rat", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "pins_per_clb", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "num_rr_nodes", scope: !2, file: !6, line: 12, type: !17, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "rr_node", scope: !2, file: !6, line: 18, type: !31, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !6, line: 14, size: 320, elements: !33)
!33 = !{!34, !36, !37, !38, !39, !40, !41, !43, !44, !46, !47}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !32, file: !6, line: 14, baseType: !35, size: 16)
!35 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 48)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 80)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !6, line: 15, baseType: !42, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rr_type", file: !6, line: 10, baseType: !5)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !32, file: !6, line: 15, baseType: !16, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !32, file: !6, line: 16, baseType: !45, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 288)
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{!"Ubuntu clang version 11.0.0-2~ubuntu20.04.1"}
!52 = distinct !DISubprogram(name: "MUSTALIAS", scope: !53, file: !53, line: 4, type: !54, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!53 = !DIFile(filename: "aliascheck.h", directory: "/home/runner/work/Test-Suite/Test-Suite")
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !{}
!58 = !DILocalVariable(name: "p", arg: 1, scope: !52, file: !53, line: 4, type: !56)
!59 = !DILocation(line: 4, column: 22, scope: !52)
!60 = !DILocalVariable(name: "q", arg: 2, scope: !52, file: !53, line: 4, type: !56)
!61 = !DILocation(line: 4, column: 31, scope: !52)
!62 = !DILocation(line: 5, column: 3, scope: !52)
!63 = !DILocation(line: 6, column: 1, scope: !52)
!64 = distinct !DISubprogram(name: "PARTIALALIAS", scope: !53, file: !53, line: 8, type: !54, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!65 = !DILocalVariable(name: "p", arg: 1, scope: !64, file: !53, line: 8, type: !56)
!66 = !DILocation(line: 8, column: 25, scope: !64)
!67 = !DILocalVariable(name: "q", arg: 2, scope: !64, file: !53, line: 8, type: !56)
!68 = !DILocation(line: 8, column: 34, scope: !64)
!69 = !DILocation(line: 9, column: 3, scope: !64)
!70 = !DILocation(line: 10, column: 1, scope: !64)
!71 = distinct !DISubprogram(name: "MAYALIAS", scope: !53, file: !53, line: 12, type: !54, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!72 = !DILocalVariable(name: "p", arg: 1, scope: !71, file: !53, line: 12, type: !56)
!73 = !DILocation(line: 12, column: 21, scope: !71)
!74 = !DILocalVariable(name: "q", arg: 2, scope: !71, file: !53, line: 12, type: !56)
!75 = !DILocation(line: 12, column: 30, scope: !71)
!76 = !DILocation(line: 13, column: 3, scope: !71)
!77 = !DILocation(line: 14, column: 1, scope: !71)
!78 = distinct !DISubprogram(name: "NOALIAS", scope: !53, file: !53, line: 16, type: !54, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!79 = !DILocalVariable(name: "p", arg: 1, scope: !78, file: !53, line: 16, type: !56)
!80 = !DILocation(line: 16, column: 20, scope: !78)
!81 = !DILocalVariable(name: "q", arg: 2, scope: !78, file: !53, line: 16, type: !56)
!82 = !DILocation(line: 16, column: 29, scope: !78)
!83 = !DILocation(line: 17, column: 3, scope: !78)
!84 = !DILocation(line: 18, column: 1, scope: !78)
!85 = distinct !DISubprogram(name: "EXPECTEDFAIL_MAYALIAS", scope: !53, file: !53, line: 20, type: !54, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!86 = !DILocalVariable(name: "p", arg: 1, scope: !85, file: !53, line: 20, type: !56)
!87 = !DILocation(line: 20, column: 34, scope: !85)
!88 = !DILocalVariable(name: "q", arg: 2, scope: !85, file: !53, line: 20, type: !56)
!89 = !DILocation(line: 20, column: 43, scope: !85)
!90 = !DILocation(line: 21, column: 3, scope: !85)
!91 = !DILocation(line: 22, column: 1, scope: !85)
!92 = distinct !DISubprogram(name: "EXPECTEDFAIL_NOALIAS", scope: !53, file: !53, line: 24, type: !54, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!93 = !DILocalVariable(name: "p", arg: 1, scope: !92, file: !53, line: 24, type: !56)
!94 = !DILocation(line: 24, column: 33, scope: !92)
!95 = !DILocalVariable(name: "q", arg: 2, scope: !92, file: !53, line: 24, type: !56)
!96 = !DILocation(line: 24, column: 42, scope: !92)
!97 = !DILocation(line: 25, column: 3, scope: !92)
!98 = !DILocation(line: 26, column: 1, scope: !92)
