; ModuleID = '/home/runner/work/Test-Suite/Test-Suite/test_cases_bc/mem_leak/malloc53.c.bc'
source_filename = "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc53.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, i32, i32*, i16*, float, float }

@nx = dso_local global i32 0, align 4, !dbg !0
@ny = dso_local global i32 0, align 4, !dbg !21
@num_rr_nodes = dso_local global i32 0, align 4, !dbg !27
@rr_node = dso_local global %struct.s_rr_node* null, align 8, !dbg !29
@io_rat = dso_local global i32 0, align 4, !dbg !23
@pins_per_clb = dso_local global i32 0, align 4, !dbg !25

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @SAFEMALLOC(i32 %n) #0 !dbg !54 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !60, metadata !DIExpression()), !dbg !61
  %0 = load i32, i32* %n.addr, align 4, !dbg !62
  %conv = sext i32 %0 to i64, !dbg !62
  %call = call noalias align 16 i8* @malloc(i64 %conv) #3, !dbg !63
  ret i8* %call, !dbg !64
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind
declare dso_local noalias align 16 i8* @malloc(i64) #2

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nx", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc53.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/mem_leak/malloc53.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "SOURCE", value: 0)
!10 = !DIEnumerator(name: "SINK", value: 1)
!11 = !DIEnumerator(name: "IPIN", value: 2)
!12 = !DIEnumerator(name: "OPIN", value: 3)
!13 = !DIEnumerator(name: "CHANX", value: 4)
!14 = !DIEnumerator(name: "CHANY", value: 5)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!20 = !{!0, !21, !23, !25, !27, !29}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "ny", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "io_rat", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "pins_per_clb", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "num_rr_nodes", scope: !2, file: !6, line: 12, type: !17, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "rr_node", scope: !2, file: !6, line: 18, type: !31, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !6, line: 14, size: 320, elements: !33)
!33 = !{!34, !36, !37, !38, !39, !40, !41, !43, !44, !46, !47}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !32, file: !6, line: 14, baseType: !35, size: 16)
!35 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 48)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 80)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !6, line: 15, baseType: !42, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rr_type", file: !6, line: 10, baseType: !5)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !32, file: !6, line: 15, baseType: !16, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !32, file: !6, line: 16, baseType: !45, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 288)
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{i32 7, !"uwtable", i32 1}
!52 = !{i32 7, !"frame-pointer", i32 2}
!53 = !{!"clang version 13.0.0"}
!54 = distinct !DISubprogram(name: "SAFEMALLOC", scope: !55, file: !55, line: 5, type: !56, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!55 = !DIFile(filename: "memleak_check.h", directory: "/home/runner/work/Test-Suite/Test-Suite")
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !17}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !{}
!60 = !DILocalVariable(name: "n", arg: 1, scope: !54, file: !55, line: 5, type: !17)
!61 = !DILocation(line: 5, column: 22, scope: !54)
!62 = !DILocation(line: 6, column: 17, scope: !54)
!63 = !DILocation(line: 6, column: 10, scope: !54)
!64 = !DILocation(line: 6, column: 3, scope: !54)
!65 = distinct !DISubprogram(name: "PLKMALLOC", scope: !55, file: !55, line: 9, type: !56, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!66 = !DILocalVariable(name: "n", arg: 1, scope: !65, file: !55, line: 9, type: !17)
!67 = !DILocation(line: 9, column: 21, scope: !65)
!68 = !DILocation(line: 10, column: 17, scope: !65)
!69 = !DILocation(line: 10, column: 10, scope: !65)
!70 = !DILocation(line: 10, column: 3, scope: !65)
!71 = distinct !DISubprogram(name: "NFRMALLOC", scope: !55, file: !55, line: 13, type: !56, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!72 = !DILocalVariable(name: "n", arg: 1, scope: !71, file: !55, line: 13, type: !17)
!73 = !DILocation(line: 13, column: 21, scope: !71)
!74 = !DILocation(line: 14, column: 17, scope: !71)
!75 = !DILocation(line: 14, column: 10, scope: !71)
!76 = !DILocation(line: 14, column: 3, scope: !71)
!77 = distinct !DISubprogram(name: "CLKMALLOC", scope: !55, file: !55, line: 17, type: !56, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!78 = !DILocalVariable(name: "n", arg: 1, scope: !77, file: !55, line: 17, type: !17)
!79 = !DILocation(line: 17, column: 21, scope: !77)
!80 = !DILocation(line: 18, column: 17, scope: !77)
!81 = !DILocation(line: 18, column: 10, scope: !77)
!82 = !DILocation(line: 18, column: 3, scope: !77)
!83 = distinct !DISubprogram(name: "NFRLEAKFP", scope: !55, file: !55, line: 21, type: !56, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!84 = !DILocalVariable(name: "n", arg: 1, scope: !83, file: !55, line: 21, type: !17)
!85 = !DILocation(line: 21, column: 21, scope: !83)
!86 = !DILocation(line: 22, column: 17, scope: !83)
!87 = !DILocation(line: 22, column: 10, scope: !83)
!88 = !DILocation(line: 22, column: 3, scope: !83)
!89 = distinct !DISubprogram(name: "PLKLEAKFP", scope: !55, file: !55, line: 25, type: !56, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!90 = !DILocalVariable(name: "n", arg: 1, scope: !89, file: !55, line: 25, type: !17)
!91 = !DILocation(line: 25, column: 21, scope: !89)
!92 = !DILocation(line: 26, column: 17, scope: !89)
!93 = !DILocation(line: 26, column: 10, scope: !89)
!94 = !DILocation(line: 26, column: 3, scope: !89)
!95 = distinct !DISubprogram(name: "LEAKFN", scope: !55, file: !55, line: 29, type: !56, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!96 = !DILocalVariable(name: "n", arg: 1, scope: !95, file: !55, line: 29, type: !17)
!97 = !DILocation(line: 29, column: 18, scope: !95)
!98 = !DILocation(line: 30, column: 17, scope: !95)
!99 = !DILocation(line: 30, column: 10, scope: !95)
!100 = !DILocation(line: 30, column: 3, scope: !95)
