; ModuleID = '/root/testsss/Test-Suite/test_cases_bc/mem_leak/malloc53.c.bc'
source_filename = "/root/testsss/Test-Suite/src/mem_leak/malloc53.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, i32, ptr, ptr, float, float }

@nx = dso_local global i32 0, align 4, !dbg !0
@ny = dso_local global i32 0, align 4, !dbg !21
@num_rr_nodes = dso_local global i32 0, align 4, !dbg !27
@rr_node = dso_local global ptr null, align 8, !dbg !29
@io_rat = dso_local global i32 0, align 4, !dbg !23
@pins_per_clb = dso_local global i32 0, align 4, !dbg !25

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @SAFEMALLOC(i32 noundef %n) #0 !dbg !56 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
    #dbg_declare(ptr %n.addr, !62, !DIExpression(), !63)
  %0 = load i32, ptr %n.addr, align 4, !dbg !64
  %conv = sext i32 %0 to i64, !dbg !64
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !65
  ret ptr %call, !dbg !66
}

; Function Attrs: nounwind allocsize(0)
declare noalias ptr @malloc(i64 noundef) #1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @PLKMALLOC(i32 noundef %n) #0 !dbg !67 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
    #dbg_declare(ptr %n.addr, !68, !DIExpression(), !69)

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nx", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 20.1.2 (++20250402124932+58df0ef89dd6-1~exp1~20250402004952.98)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/root/testsss/Test-Suite/src/mem_leak/malloc53.c", directory: "/root/testsss/Test-Suite", checksumkind: CSK_MD5, checksum: "9e7b046431413a7316877d2befa8c4b6")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/mem_leak/malloc53.c", directory: "/root/testsss/Test-Suite", checksumkind: CSK_MD5, checksum: "9e7b046431413a7316877d2befa8c4b6")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "SOURCE", value: 0)
!10 = !DIEnumerator(name: "SINK", value: 1)
!11 = !DIEnumerator(name: "IPIN", value: 2)
!12 = !DIEnumerator(name: "OPIN", value: 3)
!13 = !DIEnumerator(name: "CHANX", value: 4)
!14 = !DIEnumerator(name: "CHANY", value: 5)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!20 = !{!0, !21, !23, !25, !27, !29}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "ny", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "io_rat", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "pins_per_clb", scope: !2, file: !6, line: 11, type: !17, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "num_rr_nodes", scope: !2, file: !6, line: 12, type: !17, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "rr_node", scope: !2, file: !6, line: 18, type: !31, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !6, line: 14, size: 320, elements: !33)
!33 = !{!34, !36, !37, !38, !39, !40, !41, !43, !44, !46, !47}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !32, file: !6, line: 14, baseType: !35, size: 16)
!35 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !32, file: !6, line: 14, baseType: !35, size: 16, offset: 48)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !32, file: !6, line: 15, baseType: !35, size: 16, offset: 80)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !6, line: 15, baseType: !42, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rr_type", file: !6, line: 10, baseType: !5)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !32, file: !6, line: 15, baseType: !16, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !32, file: !6, line: 16, baseType: !45, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !32, file: !6, line: 16, baseType: !19, size: 32, offset: 288)
!48 = !{i32 7, !"Dwarf Version", i32 5}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{i32 8, !"PIC Level", i32 2}
!52 = !{i32 7, !"PIE Level", i32 2}
!53 = !{i32 7, !"uwtable", i32 2}
!54 = !{i32 7, !"frame-pointer", i32 2}
!55 = !{!"Ubuntu clang version 20.1.2 (++20250402124932+58df0ef89dd6-1~exp1~20250402004952.98)"}
!56 = distinct !DISubprogram(name: "SAFEMALLOC", scope: !57, file: !57, line: 5, type: !58, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!57 = !DIFile(filename: "memleak_check.h", directory: "/root/testsss/Test-Suite", checksumkind: CSK_MD5, checksum: "f78006bd129ed179fe44821c3aed9305")
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !17}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !{}
!62 = !DILocalVariable(name: "n", arg: 1, scope: !56, file: !57, line: 5, type: !17)
!63 = !DILocation(line: 5, column: 22, scope: !56)
!64 = !DILocation(line: 6, column: 17, scope: !56)
!65 = !DILocation(line: 6, column: 10, scope: !56)
!66 = !DILocation(line: 6, column: 3, scope: !56)
!67 = distinct !DISubprogram(name: "PLKMALLOC", scope: !57, file: !57, line: 9, type: !58, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!68 = !DILocalVariable(name: "n", arg: 1, scope: !67, file: !57, line: 9, type: !17)
!69 = !DILocation(line: 9, column: 21, scope: !67)
!70 = !DILocation(line: 10, column: 17, scope: !67)
!71 = !DILocation(line: 10, column: 10, scope: !67)
!72 = !DILocation(line: 10, column: 3, scope: !67)
!73 = distinct !DISubprogram(name: "NFRMALLOC", scope: !57, file: !57, line: 13, type: !58, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!74 = !DILocalVariable(name: "n", arg: 1, scope: !73, file: !57, line: 13, type: !17)
!75 = !DILocation(line: 13, column: 21, scope: !73)
!76 = !DILocation(line: 14, column: 17, scope: !73)
!77 = !DILocation(line: 14, column: 10, scope: !73)
!78 = !DILocation(line: 14, column: 3, scope: !73)
!79 = distinct !DISubprogram(name: "CLKMALLOC", scope: !57, file: !57, line: 17, type: !58, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!80 = !DILocalVariable(name: "n", arg: 1, scope: !79, file: !57, line: 17, type: !17)
!81 = !DILocation(line: 17, column: 21, scope: !79)
!82 = !DILocation(line: 18, column: 17, scope: !79)
!83 = !DILocation(line: 18, column: 10, scope: !79)
!84 = !DILocation(line: 18, column: 3, scope: !79)
!85 = distinct !DISubprogram(name: "NFRLEAKFP", scope: !57, file: !57, line: 21, type: !58, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!86 = !DILocalVariable(name: "n", arg: 1, scope: !85, file: !57, line: 21, type: !17)
!87 = !DILocation(line: 21, column: 21, scope: !85)
!88 = !DILocation(line: 22, column: 17, scope: !85)
!89 = !DILocation(line: 22, column: 10, scope: !85)
!90 = !DILocation(line: 22, column: 3, scope: !85)
!91 = distinct !DISubprogram(name: "PLKLEAKFP", scope: !57, file: !57, line: 25, type: !58, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!92 = !DILocalVariable(name: "n", arg: 1, scope: !91, file: !57, line: 25, type: !17)
!93 = !DILocation(line: 25, column: 21, scope: !91)
!94 = !DILocation(line: 26, column: 17, scope: !91)
!95 = !DILocation(line: 26, column: 10, scope: !91)
!96 = !DILocation(line: 26, column: 3, scope: !91)
!97 = distinct !DISubprogram(name: "LEAKFN", scope: !57, file: !57, line: 29, type: !58, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !61)
!98 = !DILocalVariable(name: "n", arg: 1, scope: !97, file: !57, line: 29, type: !17)
!99 = !DILocation(line: 29, column: 18, scope: !97)
