; ModuleID = '/home/runner/work/Test-Suite/Test-Suite/test_cases_bc/mem_leak/malloc10.c.bc'
source_filename = "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc10.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, i32*, i16*, float, float }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @SAFEMALLOC(i32 %n) #0 !dbg !9 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !15, metadata !DIExpression()), !dbg !16
  %0 = load i32, i32* %n.addr, align 4, !dbg !17
  %conv = sext i32 %0 to i64, !dbg !17
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !18
  ret i8* %call, !dbg !19
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind
declare dso_local noalias align 16 i8* @malloc(i64) #2

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @PLKMALLOC(i32 %n) #0 !dbg !20 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !21, metadata !DIExpression()), !dbg !22
  %0 = load i32, i32* %n.addr, align 4, !dbg !23
  %conv = sext i32 %0 to i64, !dbg !23
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !24
  ret i8* %call, !dbg !25
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @NFRMALLOC(i32 %n) #0 !dbg !26 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !27, metadata !DIExpression()), !dbg !28
  %0 = load i32, i32* %n.addr, align 4, !dbg !29
  %conv = sext i32 %0 to i64, !dbg !29
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !30
  ret i8* %call, !dbg !31
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @CLKMALLOC(i32 %n) #0 !dbg !32 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !33, metadata !DIExpression()), !dbg !34
  %0 = load i32, i32* %n.addr, align 4, !dbg !35
  %conv = sext i32 %0 to i64, !dbg !35
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !36
  ret i8* %call, !dbg !37
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @NFRLEAKFP(i32 %n) #0 !dbg !38 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !39, metadata !DIExpression()), !dbg !40
  %0 = load i32, i32* %n.addr, align 4, !dbg !41
  %conv = sext i32 %0 to i64, !dbg !41
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !42
  ret i8* %call, !dbg !43
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @PLKLEAKFP(i32 %n) #0 !dbg !44 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !45, metadata !DIExpression()), !dbg !46
  %0 = load i32, i32* %n.addr, align 4, !dbg !47
  %conv = sext i32 %0 to i64, !dbg !47
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !48
  ret i8* %call, !dbg !49
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @LEAKFN(i32 %n) #0 !dbg !50 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !51, metadata !DIExpression()), !dbg !52
  %0 = load i32, i32* %n.addr, align 4, !dbg !53
  %conv = sext i32 %0 to i64, !dbg !53
  %call = call noalias align 16 i8* @malloc(i64 %conv) #4, !dbg !54
  ret i8* %call, !dbg !55
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main() #0 !dbg !56 {
entry:
  %rr_node = alloca %struct.s_rr_node**, align 8
  %i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata %struct.s_rr_node*** %rr_node, metadata !60, metadata !DIExpression()), !dbg !79
  %call = call i8* @SAFEMALLOC(i32 400), !dbg !80
  %0 = bitcast i8* %call to %struct.s_rr_node**, !dbg !80
  store %struct.s_rr_node** %0, %struct.s_rr_node*** %rr_node, align 8, !dbg !81
  call void @llvm.dbg.declare(metadata i32* %i, metadata !82, metadata !DIExpression()), !dbg !83
  %call1 = call i8* @NFRMALLOC(i32 10), !dbg !84
  %1 = bitcast i8* %call1 to i32*, !dbg !84
  %2 = load %struct.s_rr_node**, %struct.s_rr_node*** %rr_node, align 8, !dbg !85
  %3 = load i32, i32* %i, align 4, !dbg !86
  %idxprom = sext i32 %3 to i64, !dbg !85
  %arrayidx = getelementptr inbounds %struct.s_rr_node*, %struct.s_rr_node** %2, i64 %idxprom, !dbg !85
  %4 = load %struct.s_rr_node*, %struct.s_rr_node** %arrayidx, align 8, !dbg !85
  %5 = load i32, i32* %i, align 4, !dbg !87
  %idxprom2 = sext i32 %5 to i64, !dbg !85
  %arrayidx3 = getelementptr inbounds %struct.s_rr_node, %struct.s_rr_node* %4, i64 %idxprom2, !dbg !85
  %edges = getelementptr inbounds %struct.s_rr_node, %struct.s_rr_node* %arrayidx3, i32 0, i32 6, !dbg !88
  store i32* %1, i32** %edges, align 8, !dbg !89
  %6 = load %struct.s_rr_node**, %struct.s_rr_node*** %rr_node, align 8, !dbg !90
  %7 = bitcast %struct.s_rr_node** %6 to i8*, !dbg !90
  call void @free(i8* %7) #4, !dbg !91
  %8 = load %struct.s_rr_node**, %struct.s_rr_node*** %rr_node, align 8, !dbg !92
  %call4 = call i32 (i8*, ...) @printf(i8* getelementptr inbounds ([3 x i8], [3 x i8]* @.str, i64 0, i64 0), %struct.s_rr_node** %8), !dbg !93
  ret i32 0, !dbg !94
}

; Function Attrs: nounwind
declare dso_local void @free(i8*) #2

declare dso_local i32 @printf(i8*, ...) #3

attributes #0 = { noinline nounwind optnone uwtable "frame-pointer"="all" "min-legal-vector-width"="0" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #1 = { nofree nosync nounwind readnone speculatable willreturn }
attributes #2 = { nounwind "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #3 = { "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #4 = { nounwind }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!3, !4, !5, !6, !7}
!llvm.ident = !{!8}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc10.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{i32 7, !"uwtable", i32 1}
!7 = !{i32 7, !"frame-pointer", i32 2}
!8 = !{!"clang version 13.0.0"}
!9 = distinct !DISubprogram(name: "SAFEMALLOC", scope: !10, file: !10, line: 5, type: !11, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DIFile(filename: "memleak_check.h", directory: "/home/runner/work/Test-Suite/Test-Suite")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DILocalVariable(name: "n", arg: 1, scope: !9, file: !10, line: 5, type: !14)
!16 = !DILocation(line: 5, column: 22, scope: !9)
!17 = !DILocation(line: 6, column: 17, scope: !9)
!18 = !DILocation(line: 6, column: 10, scope: !9)
!19 = !DILocation(line: 6, column: 3, scope: !9)
!20 = distinct !DISubprogram(name: "PLKMALLOC", scope: !10, file: !10, line: 9, type: !11, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!21 = !DILocalVariable(name: "n", arg: 1, scope: !20, file: !10, line: 9, type: !14)
!22 = !DILocation(line: 9, column: 21, scope: !20)
!23 = !DILocation(line: 10, column: 17, scope: !20)
!24 = !DILocation(line: 10, column: 10, scope: !20)
!25 = !DILocation(line: 10, column: 3, scope: !20)
!26 = distinct !DISubprogram(name: "NFRMALLOC", scope: !10, file: !10, line: 13, type: !11, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!27 = !DILocalVariable(name: "n", arg: 1, scope: !26, file: !10, line: 13, type: !14)
!28 = !DILocation(line: 13, column: 21, scope: !26)
!29 = !DILocation(line: 14, column: 17, scope: !26)
!30 = !DILocation(line: 14, column: 10, scope: !26)
!31 = !DILocation(line: 14, column: 3, scope: !26)
!32 = distinct !DISubprogram(name: "CLKMALLOC", scope: !10, file: !10, line: 17, type: !11, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!33 = !DILocalVariable(name: "n", arg: 1, scope: !32, file: !10, line: 17, type: !14)
!34 = !DILocation(line: 17, column: 21, scope: !32)
!35 = !DILocation(line: 18, column: 17, scope: !32)
!36 = !DILocation(line: 18, column: 10, scope: !32)
!37 = !DILocation(line: 18, column: 3, scope: !32)
!38 = distinct !DISubprogram(name: "NFRLEAKFP", scope: !10, file: !10, line: 21, type: !11, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!39 = !DILocalVariable(name: "n", arg: 1, scope: !38, file: !10, line: 21, type: !14)
!40 = !DILocation(line: 21, column: 21, scope: !38)
!41 = !DILocation(line: 22, column: 17, scope: !38)
!42 = !DILocation(line: 22, column: 10, scope: !38)
!43 = !DILocation(line: 22, column: 3, scope: !38)
!44 = distinct !DISubprogram(name: "PLKLEAKFP", scope: !10, file: !10, line: 25, type: !11, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!45 = !DILocalVariable(name: "n", arg: 1, scope: !44, file: !10, line: 25, type: !14)
!46 = !DILocation(line: 25, column: 21, scope: !44)
!47 = !DILocation(line: 26, column: 17, scope: !44)
!48 = !DILocation(line: 26, column: 10, scope: !44)
!49 = !DILocation(line: 26, column: 3, scope: !44)
!50 = distinct !DISubprogram(name: "LEAKFN", scope: !10, file: !10, line: 29, type: !11, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!51 = !DILocalVariable(name: "n", arg: 1, scope: !50, file: !10, line: 29, type: !14)
!52 = !DILocation(line: 29, column: 18, scope: !50)
!53 = !DILocation(line: 30, column: 17, scope: !50)
!54 = !DILocation(line: 30, column: 10, scope: !50)
!55 = !DILocation(line: 30, column: 3, scope: !50)
!56 = distinct !DISubprogram(name: "main", scope: !57, file: !57, line: 18, type: !58, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!57 = !DIFile(filename: "src/mem_leak/malloc10.c", directory: "/home/runner/work/Test-Suite/Test-Suite")
!58 = !DISubroutineType(types: !59)
!59 = !{!14}
!60 = !DILocalVariable(name: "rr_node", scope: !56, file: !57, line: 19, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !57, line: 9, size: 320, elements: !64)
!64 = !{!65, !67, !68, !69, !70, !71, !72, !74, !76, !78}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !63, file: !57, line: 10, baseType: !66, size: 16)
!66 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !63, file: !57, line: 10, baseType: !66, size: 16, offset: 16)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !63, file: !57, line: 10, baseType: !66, size: 16, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !63, file: !57, line: 10, baseType: !66, size: 16, offset: 48)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !63, file: !57, line: 11, baseType: !66, size: 16, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !63, file: !57, line: 11, baseType: !66, size: 16, offset: 80)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !63, file: !57, line: 12, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !63, file: !57, line: 13, baseType: !75, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !63, file: !57, line: 13, baseType: !77, size: 32, offset: 256)
!77 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !63, file: !57, line: 13, baseType: !77, size: 32, offset: 288)
!79 = !DILocation(line: 19, column: 20, scope: !56)
!80 = !DILocation(line: 20, column: 12, scope: !56)
!81 = !DILocation(line: 20, column: 10, scope: !56)
!82 = !DILocalVariable(name: "i", scope: !56, file: !57, line: 21, type: !14)
!83 = !DILocation(line: 21, column: 6, scope: !56)
!84 = !DILocation(line: 22, column: 24, scope: !56)
!85 = !DILocation(line: 22, column: 2, scope: !56)
!86 = !DILocation(line: 22, column: 10, scope: !56)
!87 = !DILocation(line: 22, column: 13, scope: !56)
!88 = !DILocation(line: 22, column: 16, scope: !56)
!89 = !DILocation(line: 22, column: 22, scope: !56)
!90 = !DILocation(line: 23, column: 7, scope: !56)
!91 = !DILocation(line: 23, column: 2, scope: !56)
!92 = !DILocation(line: 24, column: 14, scope: !56)
!93 = !DILocation(line: 24, column: 2, scope: !56)
!94 = !DILocation(line: 25, column: 1, scope: !56)
