; ModuleID = '/home/runner/work/Test-Suite/Test-Suite/test_cases_bc/ae_assert_tests/CVE-2022-34913-0.c.bc'
source_filename = "/home/runner/work/Test-Suite/Test-Suite/src/ae_assert_tests/CVE-2022-34913-0.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"Unable to open '%s'\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [13 x i8] c"fseek failed\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [13 x i8] c"ftell failed\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [13 x i8] c"fread failed\00", align 1, !dbg !19

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @md2roff(ptr noundef %docname, ptr noundef %source) #0 !dbg !54 {
entry:
  %docname.addr = alloca ptr, align 8
  %source.addr = alloca ptr, align 8
  %p = alloca ptr, align 8
  %appname = alloca [64 x i8], align 16
  store ptr %docname, ptr %docname.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %docname.addr, metadata !60, metadata !DIExpression()), !dbg !61
  store ptr %source, ptr %source.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %source.addr, metadata !62, metadata !DIExpression()), !dbg !63
  call void @llvm.dbg.declare(metadata ptr %p, metadata !64, metadata !DIExpression()), !dbg !65

!21 = distinct !DICompileUnit(language: DW_LANG_C11, file: !22, producer: "clang version 16.0.4 (https://github.com/bjjwwang/LLVM-compile a0f79b14ca0360151ea799a9ad1d5932235bbee1)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !23, retainedTypes: !40, globals: !45, splitDebugInlining: false, nameTableKind: None)
!22 = !DIFile(filename: "/home/runner/work/Test-Suite/Test-Suite/src/ae_assert_tests/CVE-2022-34913-0.c", directory: "/home/runner/work/Test-Suite/Test-Suite", checksumkind: CSK_MD5, checksum: "bd4c591b50f6816bac29dcbbaa955cce")
!23 = !{!24}
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 46, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "43fd45dcf96e8fb7d8f14700096497c7")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "_ISupper", value: 256)
!29 = !DIEnumerator(name: "_ISlower", value: 512)
!30 = !DIEnumerator(name: "_ISalpha", value: 1024)
!31 = !DIEnumerator(name: "_ISdigit", value: 2048)
!32 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!33 = !DIEnumerator(name: "_ISspace", value: 8192)
!34 = !DIEnumerator(name: "_ISprint", value: 16384)
!35 = !DIEnumerator(name: "_ISgraph", value: 32768)
!36 = !DIEnumerator(name: "_ISblank", value: 1)
!37 = !DIEnumerator(name: "_IScntrl", value: 2)
!38 = !DIEnumerator(name: "_ISpunct", value: 4)
!39 = !DIEnumerator(name: "_ISalnum", value: 8)
!40 = !{!41, !42, !43, !44}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!45 = !{!0, !7, !12, !17, !19}
!46 = !{i32 7, !"Dwarf Version", i32 5}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 4}
!49 = !{i32 8, !"PIC Level", i32 2}
!50 = !{i32 7, !"PIE Level", i32 2}
!51 = !{i32 7, !"uwtable", i32 2}
!52 = !{i32 7, !"frame-pointer", i32 2}
!53 = !{!"clang version 16.0.4 (https://github.com/bjjwwang/LLVM-compile a0f79b14ca0360151ea799a9ad1d5932235bbee1)"}
!54 = distinct !DISubprogram(name: "md2roff", scope: !2, file: !2, line: 18, type: !55, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !59)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!59 = !{}
!60 = !DILocalVariable(name: "docname", arg: 1, scope: !54, file: !2, line: 18, type: !57)
!61 = !DILocation(line: 18, column: 26, scope: !54)
!62 = !DILocalVariable(name: "source", arg: 2, scope: !54, file: !2, line: 18, type: !57)
!63 = !DILocation(line: 18, column: 47, scope: !54)
!64 = !DILocalVariable(name: "p", scope: !54, file: !2, line: 19, type: !57)
!65 = !DILocation(line: 19, column: 14, scope: !54)
!66 = !DILocation(line: 19, column: 18, scope: !54)
!67 = !DILocalVariable(name: "appname", scope: !54, file: !2, line: 20, type: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 64)
!71 = !DILocation(line: 20, column: 7, scope: !54)
!72 = !DILocation(line: 23, column: 3, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !2, line: 22, column: 12)
!74 = distinct !DILexicalBlock(scope: !54, file: !2, line: 22, column: 6)
!75 = !DILocation(line: 23, column: 11, scope: !73)
!76 = !DILocation(line: 24, column: 6, scope: !77)
!77 = distinct !DILexicalBlock(scope: !73, file: !2, line: 23, column: 25)
!78 = distinct !{!78, !72, !79, !80}
!79 = !DILocation(line: 25, column: 3, scope: !73)
!80 = !{!"llvm.loop.mustprogress"}
!81 = !DILocation(line: 27, column: 7, scope: !82)
!82 = distinct !DILexicalBlock(scope: !73, file: !2, line: 27, column: 7)
!83 = !DILocation(line: 27, column: 12, scope: !82)
!84 = !DILocation(line: 27, column: 19, scope: !82)
!85 = !DILocation(line: 27, column: 23, scope: !82)
!86 = !DILocation(line: 27, column: 7, scope: !73)
!87 = !DILocation(line: 29, column: 11, scope: !88)
!88 = distinct !DILexicalBlock(scope: !82, file: !2, line: 27, column: 39)
!89 = !DILocation(line: 29, column: 20, scope: !88)
!90 = !DILocation(line: 29, column: 4, scope: !88)
!91 = !DILocation(line: 30, column: 3, scope: !88)
!92 = !DILocation(line: 32, column: 1, scope: !54)
!93 = distinct !DISubprogram(name: "loadfile", scope: !2, file: !2, line: 34, type: !94, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !59)
!94 = !DISubroutineType(types: !95)
!95 = !{!44, !57}
!96 = !DILocalVariable(name: "filename", arg: 1, scope: !93, file: !2, line: 34, type: !57)
!97 = !DILocation(line: 34, column: 28, scope: !93)
!98 = !DILocalVariable(name: "len", scope: !93, file: !2, line: 35, type: !41)
!99 = !DILocation(line: 35, column: 6, scope: !93)
!100 = !DILocalVariable(name: "fp", scope: !93, file: !2, line: 36, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !103, line: 7, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "7a6d4a00a37ee6b9a40cd04bd01f5d00")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !124, !125, !126, !130, !131, !133, !137, !140, !142, !145, !148, !149, !150, !154, !155}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !104, file: !105, line: 51, baseType: !41, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !104, file: !105, line: 54, baseType: !44, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !104, file: !105, line: 55, baseType: !44, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !104, file: !105, line: 56, baseType: !44, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !104, file: !105, line: 57, baseType: !44, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !104, file: !105, line: 58, baseType: !44, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !104, file: !105, line: 59, baseType: !44, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !104, file: !105, line: 60, baseType: !44, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !104, file: !105, line: 61, baseType: !44, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !104, file: !105, line: 64, baseType: !44, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !104, file: !105, line: 65, baseType: !44, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !104, file: !105, line: 66, baseType: !44, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !104, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !105, line: 36, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !104, file: !105, line: 70, baseType: !123, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !104, file: !105, line: 72, baseType: !41, size: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !104, file: !105, line: 73, baseType: !41, size: 32, offset: 928)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !104, file: !105, line: 74, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !128, line: 152, baseType: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!129 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !104, file: !105, line: 77, baseType: !42, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !104, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !104, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !104, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !105, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !104, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !128, line: 153, baseType: !129)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !104, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !105, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !104, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !105, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !104, file: !105, line: 93, baseType: !123, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !104, file: !105, line: 94, baseType: !43, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !104, file: !105, line: 95, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
!152 = !DIFile(filename: "/opt/llvm/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!153 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !104, file: !105, line: 96, baseType: !41, size: 32, offset: 1536)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !104, file: !105, line: 98, baseType: !9, size: 160, offset: 1568)
!156 = !DILocation(line: 36, column: 8, scope: !93)
!157 = !DILocalVariable(name: "buf", scope: !93, file: !2, line: 37, type: !44)
!158 = !DILocation(line: 37, column: 8, scope: !93)
!159 = !DILocation(line: 39, column: 7, scope: !160)
!160 = distinct !DILexicalBlock(scope: !93, file: !2, line: 39, column: 7)
!161 = !DILocation(line: 39, column: 16, scope: !160)
!162 = !DILocation(line: 39, column: 7, scope: !93)
!163 = !DILocation(line: 40, column: 14, scope: !164)
!164 = distinct !DILexicalBlock(scope: !160, file: !2, line: 39, column: 26)
!165 = !DILocation(line: 40, column: 8, scope: !164)
!166 = !DILocation(line: 40, column: 6, scope: !164)
!167 = !DILocation(line: 41, column: 7, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !2, line: 41, column: 7)
!169 = !DILocation(line: 41, column: 10, scope: !168)
!170 = !DILocation(line: 41, column: 7, scope: !164)
!171 = !DILocation(line: 42, column: 34, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !2, line: 41, column: 19)
!173 = !DILocation(line: 42, column: 4, scope: !172)
!174 = !DILocation(line: 43, column: 4, scope: !172)
!175 = !DILocation(line: 45, column: 13, scope: !176)
!176 = distinct !DILexicalBlock(scope: !164, file: !2, line: 45, column: 7)
!177 = !DILocation(line: 45, column: 7, scope: !176)
!178 = !DILocation(line: 45, column: 31, scope: !176)
!179 = !DILocation(line: 45, column: 7, scope: !164)
!180 = !DILocation(line: 46, column: 4, scope: !181)
!181 = distinct !DILexicalBlock(scope: !176, file: !2, line: 45, column: 38)
!182 = !DILocation(line: 47, column: 4, scope: !181)
!183 = !DILocation(line: 49, column: 15, scope: !164)
!184 = !DILocation(line: 49, column: 9, scope: !164)
!185 = !DILocation(line: 49, column: 7, scope: !164)
!186 = !DILocation(line: 50, column: 7, scope: !187)
!187 = distinct !DILexicalBlock(scope: !164, file: !2, line: 50, column: 7)
!188 = !DILocation(line: 50, column: 11, scope: !187)
!189 = !DILocation(line: 50, column: 7, scope: !164)
!190 = !DILocation(line: 51, column: 4, scope: !191)
!191 = distinct !DILexicalBlock(scope: !187, file: !2, line: 50, column: 18)
!192 = !DILocation(line: 52, column: 4, scope: !191)
!193 = !DILocation(line: 54, column: 12, scope: !194)
!194 = distinct !DILexicalBlock(scope: !164, file: !2, line: 54, column: 6)
!195 = !DILocation(line: 54, column: 6, scope: !194)
!196 = !DILocation(line: 54, column: 30, scope: !194)
!197 = !DILocation(line: 54, column: 6, scope: !164)
!198 = !DILocation(line: 55, column: 4, scope: !199)
!199 = distinct !DILexicalBlock(scope: !194, file: !2, line: 54, column: 37)
!200 = !DILocation(line: 56, column: 4, scope: !199)
!201 = !DILocation(line: 58, column: 25, scope: !164)
!202 = !DILocation(line: 58, column: 28, scope: !164)
!203 = !DILocation(line: 58, column: 18, scope: !164)
!204 = !DILocation(line: 58, column: 7, scope: !164)
!205 = !DILocation(line: 59, column: 12, scope: !206)
!206 = distinct !DILexicalBlock(scope: !164, file: !2, line: 59, column: 6)
!207 = !DILocation(line: 59, column: 17, scope: !206)
!208 = !DILocation(line: 59, column: 25, scope: !206)
!209 = !DILocation(line: 59, column: 6, scope: !206)
!210 = !DILocation(line: 59, column: 29, scope: !206)
!211 = !DILocation(line: 59, column: 6, scope: !164)
!212 = !DILocation(line: 60, column: 4, scope: !213)
!213 = distinct !DILexicalBlock(scope: !206, file: !2, line: 59, column: 36)
!214 = !DILocation(line: 61, column: 4, scope: !213)
!215 = !DILocation(line: 63, column: 3, scope: !164)
!216 = !DILocation(line: 63, column: 7, scope: !164)
!217 = !DILocation(line: 63, column: 12, scope: !164)
!218 = !DILocation(line: 64, column: 10, scope: !164)
!219 = !DILocation(line: 64, column: 3, scope: !164)
!220 = !DILocation(line: 65, column: 2, scope: !164)
!221 = !DILocation(line: 67, column: 9, scope: !93)
!222 = !DILocation(line: 67, column: 2, scope: !93)
