; ModuleID = 'test_cases_bc/ae_assert_tests/CVE-2022-34913-0_no-main.c.bc'
source_filename = "src/ae_assert_tests/CVE-2022-34913-0_no-main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"Unable to open '%s'\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [13 x i8] c"fseek failed\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [13 x i8] c"ftell failed\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [13 x i8] c"fread failed\00", align 1, !dbg !19

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @md2roff(ptr noundef %docname, ptr noundef %source) #0 !dbg !53 {
entry:
  %docname.addr = alloca ptr, align 8
  %source.addr = alloca ptr, align 8
  %p = alloca ptr, align 8
  %appname = alloca [64 x i8], align 16
  store ptr %docname, ptr %docname.addr, align 8
    #dbg_declare(ptr %docname.addr, !59, !DIExpression(), !60)
  store ptr %source, ptr %source.addr, align 8
    #dbg_declare(ptr %source.addr, !61, !DIExpression(), !62)
    #dbg_declare(ptr %p, !63, !DIExpression(), !64)
  %0 = load ptr, ptr %source.addr, align 8, !dbg !65
  store ptr %0, ptr %p, align 8, !dbg !64
    #dbg_declare(ptr %appname, !66, !DIExpression(), !70)
  br label %while.cond, !dbg !71


!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !14, isLocal: true, isDefinition: true)
!21 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 21.1.0 (https://github.com/bjjwwang/LLVM-compile 4f7056e8ada487923d1c8f9bc38df6472008eda3)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !39, globals: !44, splitDebugInlining: false, nameTableKind: None)
!22 = !{!23}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 46, baseType: !25, size: 32, elements: !26)
!24 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!27 = !DIEnumerator(name: "_ISupper", value: 256)
!28 = !DIEnumerator(name: "_ISlower", value: 512)
!29 = !DIEnumerator(name: "_ISalpha", value: 1024)
!30 = !DIEnumerator(name: "_ISdigit", value: 2048)
!31 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!32 = !DIEnumerator(name: "_ISspace", value: 8192)
!33 = !DIEnumerator(name: "_ISprint", value: 16384)
!34 = !DIEnumerator(name: "_ISgraph", value: 32768)
!35 = !DIEnumerator(name: "_ISblank", value: 1)
!36 = !DIEnumerator(name: "_IScntrl", value: 2)
!37 = !DIEnumerator(name: "_ISpunct", value: 4)
!38 = !DIEnumerator(name: "_ISalnum", value: 8)
!39 = !{!40, !41, !42, !43}
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!44 = !{!0, !7, !12, !17, !19}
!45 = !{i32 7, !"Dwarf Version", i32 5}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{i32 1, !"wchar_size", i32 4}
!48 = !{i32 8, !"PIC Level", i32 2}
!49 = !{i32 7, !"PIE Level", i32 2}
!50 = !{i32 7, !"uwtable", i32 2}
!51 = !{i32 7, !"frame-pointer", i32 2}
!52 = !{!"clang version 21.1.0 (https://github.com/bjjwwang/LLVM-compile 4f7056e8ada487923d1c8f9bc38df6472008eda3)"}
!53 = distinct !DISubprogram(name: "md2roff", scope: !2, file: !2, line: 18, type: !54, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !58)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!58 = !{}
!59 = !DILocalVariable(name: "docname", arg: 1, scope: !53, file: !2, line: 18, type: !56)
!60 = !DILocation(line: 18, column: 26, scope: !53)
!61 = !DILocalVariable(name: "source", arg: 2, scope: !53, file: !2, line: 18, type: !56)
!62 = !DILocation(line: 18, column: 47, scope: !53)
!63 = !DILocalVariable(name: "p", scope: !53, file: !2, line: 19, type: !56)
!64 = !DILocation(line: 19, column: 14, scope: !53)
!65 = !DILocation(line: 19, column: 18, scope: !53)
!66 = !DILocalVariable(name: "appname", scope: !53, file: !2, line: 20, type: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 64)
!70 = !DILocation(line: 20, column: 7, scope: !53)
!71 = !DILocation(line: 23, column: 3, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !2, line: 22, column: 12)
!73 = distinct !DILexicalBlock(scope: !53, file: !2, line: 22, column: 6)
!74 = !DILocation(line: 23, column: 11, scope: !72)
!75 = !DILocation(line: 24, column: 6, scope: !76)
!76 = distinct !DILexicalBlock(scope: !72, file: !2, line: 23, column: 25)
!77 = distinct !{!77, !71, !78, !79}
!78 = !DILocation(line: 25, column: 3, scope: !72)
!79 = !{!"llvm.loop.mustprogress"}
!80 = !DILocation(line: 27, column: 7, scope: !81)
!81 = distinct !DILexicalBlock(scope: !72, file: !2, line: 27, column: 7)
!82 = !DILocation(line: 27, column: 12, scope: !81)
!83 = !DILocation(line: 27, column: 19, scope: !81)
!84 = !DILocation(line: 27, column: 23, scope: !81)
!85 = !DILocation(line: 29, column: 11, scope: !86)
!86 = distinct !DILexicalBlock(scope: !81, file: !2, line: 27, column: 39)
!87 = !DILocation(line: 29, column: 20, scope: !86)
!88 = !DILocation(line: 29, column: 4, scope: !86)
!89 = !DILocation(line: 30, column: 3, scope: !86)
!90 = !DILocation(line: 32, column: 1, scope: !53)
!91 = distinct !DISubprogram(name: "loadfile", scope: !2, file: !2, line: 34, type: !92, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !58)
!92 = !DISubroutineType(types: !93)
!93 = !{!43, !56}
!94 = !DILocalVariable(name: "filename", arg: 1, scope: !91, file: !2, line: 34, type: !56)
!95 = !DILocation(line: 34, column: 28, scope: !91)
!96 = !DILocalVariable(name: "len", scope: !91, file: !2, line: 35, type: !40)
!97 = !DILocation(line: 35, column: 6, scope: !91)
!98 = !DILocalVariable(name: "fp", scope: !91, file: !2, line: 36, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 7, baseType: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 49, size: 1728, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !120, !122, !123, !124, !128, !129, !131, !135, !138, !140, !143, !146, !147, !148, !152, !153}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 51, baseType: !40, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 54, baseType: !43, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 55, baseType: !43, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 56, baseType: !43, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 57, baseType: !43, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 58, baseType: !43, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 59, baseType: !43, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 60, baseType: !43, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 61, baseType: !43, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 64, baseType: !43, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 65, baseType: !43, size: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 66, baseType: !43, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 68, baseType: !118, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 36, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 70, baseType: !121, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 72, baseType: !40, size: 32, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 73, baseType: !40, size: 32, offset: 928)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 74, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !126, line: 152, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!127 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 77, baseType: !41, size: 16, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 78, baseType: !130, size: 8, offset: 1040)
!130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 79, baseType: !132, size: 8, offset: 1048)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 81, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 43, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 89, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !126, line: 153, baseType: !127)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !102, file: !103, line: 91, baseType: !141, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !103, line: 37, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !102, file: !103, line: 92, baseType: !144, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !103, line: 38, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !102, file: !103, line: 93, baseType: !121, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !102, file: !103, line: 94, baseType: !42, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 95, baseType: !149, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 18, baseType: !151)
!150 = !DIFile(filename: "master/llvm-21.1.0.obj/lib/clang/21/include/__stddef_size_t.h", directory: "/mnt/scratch/PAG/Wjw/vibe/SVF", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!151 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 96, baseType: !40, size: 32, offset: 1536)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 98, baseType: !9, size: 160, offset: 1568)
!154 = !DILocation(line: 36, column: 8, scope: !91)
!155 = !DILocalVariable(name: "buf", scope: !91, file: !2, line: 37, type: !43)
!156 = !DILocation(line: 37, column: 8, scope: !91)
!157 = !DILocation(line: 39, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !91, file: !2, line: 39, column: 7)
!159 = !DILocation(line: 39, column: 16, scope: !158)
!160 = !DILocation(line: 40, column: 14, scope: !161)
!161 = distinct !DILexicalBlock(scope: !158, file: !2, line: 39, column: 26)
!162 = !DILocation(line: 40, column: 8, scope: !161)
!163 = !DILocation(line: 40, column: 6, scope: !161)
!164 = !DILocation(line: 41, column: 7, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !2, line: 41, column: 7)
!166 = !DILocation(line: 41, column: 10, scope: !165)
!167 = !DILocation(line: 42, column: 34, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !2, line: 41, column: 19)
!169 = !DILocation(line: 42, column: 4, scope: !168)
!170 = !DILocation(line: 43, column: 4, scope: !168)
!171 = !DILocation(line: 45, column: 13, scope: !172)
!172 = distinct !DILexicalBlock(scope: !161, file: !2, line: 45, column: 7)
!173 = !DILocation(line: 45, column: 7, scope: !172)
!174 = !DILocation(line: 45, column: 31, scope: !172)
!175 = !DILocation(line: 46, column: 4, scope: !176)
!176 = distinct !DILexicalBlock(scope: !172, file: !2, line: 45, column: 38)
!177 = !DILocation(line: 47, column: 4, scope: !176)
!178 = !DILocation(line: 49, column: 15, scope: !161)
!179 = !DILocation(line: 49, column: 9, scope: !161)
!180 = !DILocation(line: 49, column: 7, scope: !161)
!181 = !DILocation(line: 50, column: 7, scope: !182)
!182 = distinct !DILexicalBlock(scope: !161, file: !2, line: 50, column: 7)
!183 = !DILocation(line: 50, column: 11, scope: !182)
!184 = !DILocation(line: 51, column: 4, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !2, line: 50, column: 18)
!186 = !DILocation(line: 52, column: 4, scope: !185)
!187 = !DILocation(line: 54, column: 12, scope: !188)
!188 = distinct !DILexicalBlock(scope: !161, file: !2, line: 54, column: 6)
!189 = !DILocation(line: 54, column: 6, scope: !188)
!190 = !DILocation(line: 54, column: 30, scope: !188)
!191 = !DILocation(line: 55, column: 4, scope: !192)
!192 = distinct !DILexicalBlock(scope: !188, file: !2, line: 54, column: 37)
!193 = !DILocation(line: 56, column: 4, scope: !192)
!194 = !DILocation(line: 58, column: 25, scope: !161)
!195 = !DILocation(line: 58, column: 28, scope: !161)
!196 = !DILocation(line: 58, column: 18, scope: !161)
!197 = !DILocation(line: 58, column: 7, scope: !161)
!198 = !DILocation(line: 59, column: 12, scope: !199)
!199 = distinct !DILexicalBlock(scope: !161, file: !2, line: 59, column: 6)
!200 = !DILocation(line: 59, column: 17, scope: !199)
!201 = !DILocation(line: 59, column: 25, scope: !199)
!202 = !DILocation(line: 59, column: 6, scope: !199)
!203 = !DILocation(line: 59, column: 29, scope: !199)
!204 = !DILocation(line: 60, column: 4, scope: !205)
!205 = distinct !DILexicalBlock(scope: !199, file: !2, line: 59, column: 36)
!206 = !DILocation(line: 61, column: 4, scope: !205)
!207 = !DILocation(line: 63, column: 3, scope: !161)
!208 = !DILocation(line: 63, column: 7, scope: !161)
!209 = !DILocation(line: 63, column: 12, scope: !161)
!210 = !DILocation(line: 64, column: 10, scope: !161)
!211 = !DILocation(line: 64, column: 3, scope: !161)
!212 = !DILocation(line: 65, column: 2, scope: !161)
!213 = !DILocation(line: 67, column: 9, scope: !91)
!214 = !DILocation(line: 67, column: 2, scope: !91)
!215 = distinct !DISubprogram(name: "no_main_CVE_2022_34913_0", scope: !2, file: !2, line: 70, type: !216, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !58)
!216 = !DISubroutineType(types: !217)
!217 = !{!40, !40, !218}
